# -*- org-export-babel-evaluate: nil -*-
#+TITLE: In-depth notes on data science related topics
#+AUTHOR: Bart Frenk
#+EMAIL: bart.frenk@gmail.com

#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{paralist}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage{palatino}
#+LATEX_HEADER: \usepackage{euler}
#+LATEX_HEADER: \usepackage{setspace}
#+LATEX_HEADER: \renewcommand{\em}[1]{\textbf{#1}}
#+LATEX_HEADER: \newcommand{\E}[1]{\operatorname{\mathbb{E}}[#1]}
#+LATEX_HEADER: \setstretch{1.2}
#+LATEX_HEADER: \let\itemize\compactitem
#+LATEX_HEADER: \let\description\compactdesc
#+LATEX_HEADER: \let\enumerate\compactenum
#+LATEX_HEADER: \setlength{\parindent}{0em}
#+LATEX_HEADER: \setlength{\parskip}{1em}
#+LATEX_HEADER: \newcommand{\RR}{\mathbb{R}}
#+OPTIONS: toc:nil

#+TAGS: noexport

** Set up a connection to jupyter session
Start =jupyter console= in an appropriate directory (e.g., one which works with
a miniconda environment). This creates a =kernel-<xxxx>.json= file in the
directory below.

List all active kernels.
#+NAME: kernels
#+BEGIN_SRC sh
ls ${kernel_dir}
#+END_SRC

#+RESULTS: kernels
| kernel-data-science-tex.json |
| notebook_cookie_secret       |

Create directory to store temporary (image) files:
#+BEGIN_SRC sh :var kernels=kernels 
mkdir -p /tmp/data-science-tex
mv ${kernel_dir}/$(echo ${kernels} | cut -d " " -f1) ${kernel_dir}/${kernel_target}
#+END_SRC

#+RESULTS:

#+BEGIN_SRC ipython :session kernel-data-science-tex.json :exports code
import sys
sys.version
#+END_SRC

#+RESULTS:
: # Out[1]:
: : '3.5.2 (default, Nov 23 2017, 16:37:01) \n[GCC 5.4.0 20160609]'

*** Examples

#+BEGIN_SRC ipython :session kernel-data-science-tex.json
x = 2
x
#+END_SRC

#+RESULTS[eb3041bf86be280db2a737f988866122988aee56]:
: # Out[4]:
: : 2



